{
  "fighter1": "Henry cejudo",
  "fighter2": "payton talbott",
  "stats1": {
    "name": "Henry Cejudo",
    "fighterId": "3023388",
    "link": "https://www.espn.com/mma/fighter/_/id/3023388/henry-cejudo",
    "image": "https://a.espncdn.com/i/headshots/mma/players/full/3023388.png",
    "sport": "mma",
    "record": "16-5-0",
    "height": "5'4\" (163cm)",
    "reach": "67.5\" (171cm)",
    "weight_class": "Bantamweight",
    "last_weigh_in": "135.0 lbs",
    "team": "Fight Ready MMA"
  },
  "stats2": {
    "name": "Payton Talbott",
    "fighterId": "5144008",
    "link": "https://www.espn.com/mma/fighter/_/id/5144008/payton-talbott",
    "image": "https://a.espncdn.com/i/headshots/mma/players/full/5144008.png",
    "sport": "mma",
    "record": "10-1-0",
    "height": "5'10\" (178cm)",
    "reach": "70.0\" (178cm)",
    "weight_class": "Bantamweight",
    "last_weigh_in": "136.0 lbs",
    "team": "Reno Academy of Combat and fitness"
  },
  "result": "<h3>Fight Analysis: Henry Cejudo vs. Payton Talbott</h3>\n\n<h4>Striking</h4>\n<p>Henry Cejudo showcases a well-rounded striking game, with a significant focus on boxing and kickboxing techniques. He averages 4.73 significant strikes landed per minute with an accuracy of 39%. Cejudo also possesses strong defensive striking skills, absorbing only 3.02 strikes per minute.</p>\n<p>In contrast, Payton Talbott has shown promising striking ability with an output of 5.00 significant strikes landed per minute and an accuracy rate around 45%. Talbott's height and reach advantage could play a crucial role in maintaining distance against Cejudo.</p>\n\n<h4>Grappling</h4>\n<p>Cejudo, an Olympic gold medalist in wrestling, has a takedown average of 2.89 per 15 minutes with an impressive takedown accuracy of 34%. His grappling is complemented by his ability to defend against takedowns, boasting a 65% takedown defense rate.</p>\n<p>Payton Talbott, while primarily known for his striking, has demonstrated solid grappling skills as well. However, he lacks the Olympic-level wrestling credentials of Cejudo and may struggle to maintain control on the ground if the fight transitions there.</p>\n\n<h4>Fight IQ</h4>\n<p>Henry Cejudo is renowned for his high fight IQ, adapting his strategies mid-fight effectively. His experience in championship bouts often allows him to exploit his opponent's weaknesses. He has shown the ability to control tempo and rhythm during fights, making adjustments as needed.</p>\n<p>Payton Talbott has shown potential in fight IQ, but his relative inexperience in high-stakes matchups may limit his adaptability against a seasoned fighter like Cejudo.</p>\n\n<h4>Current Form</h4>\n<p>Cejudo returned from a brief retirement with a record of 16-5, showcasing resilience and determination in his recent bouts. He brings significant experience against top-tier competition.</p>\n<p>Talbott’s record of 10-1 reflects promise, and his performance in recent fights suggests he is on an upward trajectory. However, his experience level may not measure up against Cejudo’s extensive history in the octagon.</p>\n\n<h3>Prediction</h3>\n<p>Taking into account striking accuracy, grappling prowess, fight IQ, and current form, <strong>Henry Cejudo</strong> is the likely winner against <strong>Payton Talbott</strong>. Cejudo’s superior wrestling and striking acumen, coupled with his ability to adapt and execute strategies under pressure, give him a distinct advantage over Talbott, who may find it challenging to cope with Cejudo's high-level skills.</p>"
}